from aiogram import Router, F
from aiogram.types import Message

router = Router()


@router.message(F.text == "⚠️ Протипоказання")
async def contraindications(message: Message):
    await message.answer(
        "⚠️ Протипоказання до процедури перманентного макіяжу\n\n"

        "Перед процедурою обов'язково ознайомтеся з протипоказаннями:\n\n"

        "• Інсулінозалежний цукровий діабет;\n"
        "• Захворювання крові (тромбофілія, гемофілія);\n"
        "• Важкі захворювання внутрішніх органів, стани імунодефіциту, ВІЛ, гепатит;\n"
        "• Захворювання шкіри в зоні ПМ (псоріаз, хейліт, дерматити, нейродерміти);\n"
        "• Інфекції та субфебрильна температура;\n"
        "• Онкологічні захворювання;\n"
        "• Епілепсія, бронхіальна астма;\n"
        "• Родимки або пігментні плями у зоні перманенту;\n"
        "• Схильність до утворення келоїдних рубців;\n"
        "• Вживання алкоголю в день та за один день до процедури;\n"
        "• Заїди та герпес у зоні ПМ;\n"
        "• Опіки, рубці, операції в зоні ПМ (менше 1 року);\n"
        "• Прийом антибіотиків."
    )